groupmates = [
    {
 "name": "Илья",
 "surname": "Загумённов",
 "exams": ["Информатика", "ЭЭиС", "Web"],
 "marks": [4, 3, 5]
    },
    {
 "name": "Денис",
 "surname": "Лукинов",
 "exams": ["История", "АиГ", "КТП"],
 "marks": [4, 4, 4]
    },
    {
 "name": "Иван",
 "surname": "Иванов",
 "exams": ["Философия", "ИС", "КТП"],
 "marks": [5, 5, 5]
    },
    {
 "name": "Михаил",
 "surname": "Петров",
 "exams": ["Русский", "История", "ПИС"],
 "marks": [4, 4, 4]
    },
    {
 "name": "Андрей",
 "surname": "Андреев",
 "exams": ["Химия", "Физика", "КТП"],
 "marks": [5, 5, 5]
    }
 ]